Процедура ОбработкаПроведения(Отказ,Режим)

	Если ВидОперации = Перечисления.ВидыОперацийСоСчетами.Пополнение Тогда
		ВидДвижения = ВидДвиженияНакопления.Приход;	
	Иначе
		ВидДвижения = ВидДвиженияНакопления.Расход;	
	КонецЕсли;

	// регистр ОстаткиНаСчетах
	Движения.ОстаткиНаСчетах.Записывать = Истина;
	Движение = Движения.ОстаткиНаСчетах.Добавить();
	Движение.ВидДвижения = ВидДвижения;
	Движение.Период = Дата;
	Движение.Пользователь = Пользователь;
	Движение.Счет = СчетСписания;
	Движение.Баланс = Сумма;

	Движения.ОстаткиНаСчетах.Записывать = Истина;
	Движения.ОстаткиНаСчетах.БлокироватьДляИзменения = Истина;
	Движения.Записать();

	Если Не ВидДвижения = ВидДвиженияНакопления.Приход Тогда
	//Контроль оотрицательного баланса
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ПРЕДСТАВЛЕНИЕ(ОстаткиНаСчетахОстатки.Счет) КАК СчетПредставление,
		|	ОстаткиНаСчетахОстатки.БалансОстаток КАК БалансОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиНаСчетах.Остатки(&МоментВремениВключая, Счет = &Счет) КАК ОстаткиНаСчетахОстатки
		|ГДЕ
		|	ОстаткиНаСчетахОстатки.БалансОстаток < 0";

		Запрос.УстановитьПараметр("МоментВремениВключая", Новый Граница(МоментВремени(), ВидГраницы.Включая));
		Запрос.УстановитьПараметр("Счет", СчетСписания);

		РезультатЗапроса = Запрос.Выполнить();

		Если Не РезультатЗапроса.Пустой() Тогда
			Отказ = Истина;

			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();

			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("На счету: %1 Не хватает денежных средств: %2!", Выборка.СчетПредставление,
				-Выборка.БалансОстаток);
			Сообщение.Сообщить();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
