
#Область ОбработчикиСобытий

Функция ШаблонURLПучитьСписокПродуктов(Запрос)
	
	Ответ = Новый HTTPСервисОтвет(200);
	
	Параметры = Запрос.ПараметрыURL;
	Попытка
		Владелец = Справочники.Пользователи.ПолучитьСсылку(Новый УникальныйИдентификатор(Параметры.Получить("id")));
	Исключение   
		Ответ.КодСостояния = 400;
	КонецПопытки;
	
	Если ЗначениеЗаполнено(Владелец) Тогда
		МассивПродуктов = Новый	Массив;
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	ЕСТЬNULL(ОстаткиНаСчетахОстатки.БалансОстаток, 0) КАК БалансОстаток,
			|	Продукты.Код КАК Код,
			|	Продукты.Наименование КАК Наименование,
			|	ПРЕДСТАВЛЕНИЕ(Продукты.ТипПродукта) КАК ТипПродукта,
			|	ПРЕДСТАВЛЕНИЕ(Продукты.Банк) КАК Банк
			|ИЗ
			|	Справочник.Продукты КАК Продукты
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиНаСчетах.Остатки(, Пользователь = &Пользователь) КАК ОстаткиНаСчетахОстатки
			|		ПО ОстаткиНаСчетахОстатки.Счет = Продукты.Ссылка";
		
		Запрос.УстановитьПараметр("Пользователь", Владелец);
		
		РезультатЗапроса = Запрос.Выполнить();
		Если Не РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				Продукт = Новый Структура;
				Продукт.Вставить("Код", 			Выборка.Код);
				Продукт.Вставить("Наименование", 	Выборка.Наименование);
				Продукт.Вставить("ТипПродукта", 	Выборка.ТипПродукта);
				Продукт.Вставить("Банк", 			Выборка.Банк);
				Продукт.Вставить("Баланс", 			Выборка.БалансОстаток);
		
				МассивПродуктов.Добавить(Продукт);	
			КонецЦикла;
		Иначе
			Ответ.КодСостояния = 204;
		КонецЕсли;
	КонецЕсли;
	
	ДанныеВозврата = Новый Структура("Products", МассивПродуктов);
	СериализаватьВJSON(ДанныеВозврата);
	Ответ.УстановитьТелоИзСтроки(ДанныеВозврата);

	Возврат Ответ;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СериализаватьВJSON(Данные)
	
	Запись = Новый ЗаписьJSON();
	Запись.УстановитьСтроку();
	ЗаписатьJSON(Запись, Данные);
	
	Данные = Запись.Закрыть();
	
КонецПроцедуры

#КонецОбласти
